---
kind: type
id: T:Autodesk.Revit.DB.WallCrossSection
source: html/c0017a61-ed27-8124-f3f7-17d73c446169.htm
---
# Autodesk.Revit.DB.WallCrossSection

The allowed values for the WALL_CROSS_SECTION parameter.

## Syntax (C#)
```csharp
public enum WallCrossSection
```